# Иван е програмист в американска компания и работи от вкъщи средно N дни в месеца, като изкарва средно по M долара на ден.
# В края на годината Иван получава бонус, който е равен на 2.5 месечни заплати. От спечеленото през годината му се удържат 25% данъци.
# Напишете програма, която да пресмята колко е чистата средна печалба на Иван на ден в лева, тъй като той харчи изкараното в България.
# Приема се, че в годината има точно 365 дни. Курсът на долара спрямо лева ще се подава на функцията.

n = int(input())
m = float(input())
exchange = float(input())

monthly_pay = n*m
yearly_pay = ((monthly_pay*12)+(monthly_pay*2.5))*0.75
daily_earnings = (yearly_pay/365)*exchange

print(f'{daily_earnings:.2f}')
